In [24]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,2,5])
obj

0    4
1    7
2    2
3    5
dtype: int64

In [3]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
obj.values

array([4, 7, 2, 5], dtype=int64)

In [5]:
obj2 = pd.Series([4,7,8,5], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c    8
d    5
dtype: int64

In [10]:
obj2["a":"c"]

a    4
b    7
c    8
dtype: int64

In [9]:
obj2[["a","c"]]

a    4
c    8
dtype: int64

In [13]:
obj2[obj2 > 6]

b    7
c    8
dtype: int64

In [15]:
sdata = {"Ohio":35000, "Texas":71000, "Oregon":16000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

In [16]:
states = ["Cafe", "Texas", "Oregon"]
obj4 = pd.Series(sdata, states)
obj4

Cafe          NaN
Texas     71000.0
Oregon    16000.0
dtype: float64

In [29]:
obj3 + obj4

Cafe           NaN
Ohio           NaN
Oregon     32000.0
Texas     142000.0
dtype: float64

In [31]:
obj4.index=["aaa", 'bbb', 'ccc']
obj4

aaa        NaN
bbb    71000.0
ccc    16000.0
dtype: float64

In [6]:
data = {
    "state": ["holo", "honn", "nihi"],
    "year": [2000, 2001, 2002],
    "pop": [1.5, 1.2, 1.3]
}
frame = pd.DataFrame(data)
frame

  state  year  pop
0  holo  2000  1.5
1  honn  2001  1.2
2  nihi  2002  1.3

In [3]:
frame = pd.DataFrame(data, columns=["year", "state", "pop"])
frame

   year state  pop
0  2000  holo  1.5
1  2001  honn  1.2
2  2002  nihi  1.3

In [4]:
frame1 = pd.DataFrame(data, columns=["year", "state", "pop", "san"])
frame1

   year state  pop  san
0  2000  holo  1.5  NaN
1  2001  honn  1.2  NaN
2  2002  nihi  1.3  NaN

In [7]:
frame["year"]

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [8]:
frame.year

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [12]:
frame1["san"] = [2.3, 3.3, 3.4]
frame1

   year state  pop  san
0  2000  holo  1.5  2.3
1  2001  honn  1.2  3.3
2  2002  nihi  1.3  3.4

In [14]:
del frame1["san"]
frame1

   year state  pop
0  2000  holo  1.5
1  2001  honn  1.2
2  2002  nihi  1.3

In [15]:
frame["latest"] = frame.year > 2001
frame

  state  year  pop  latest
0  holo  2000  1.5   False
1  honn  2001  1.2   False
2  nihi  2002  1.3    True

In [16]:
#基本功能
obj = pd.Series([4.5, 3.3, 5.6, 5.2], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    3.3
a    5.6
c    5.2
dtype: float64

In [17]:
obj2 = obj.reindex(['a', 'b' ,'c', 'd'])
obj2

a    5.6
b    3.3
c    5.2
d    4.5
dtype: float64

In [19]:
obj3 = obj.reindex(['a', 'b' ,'c', 'd', 'e'])
obj3

a    5.6
b    3.3
c    5.2
d    4.5
e    NaN
dtype: float64

In [20]:
obj4 = obj.reindex(['a', 'b' ,'c', 'd', 'e'], fill_value=0)
obj4

a    5.6
b    3.3
c    5.2
d    4.5
e    0.0
dtype: float64

In [25]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a', 'b', 'c'], columns=['ohio', 'teax', 'cali'])
frame

   ohio  teax  cali
a     0     1     2
b     3     4     5
c     6     7     8

In [26]:
frame.reindex(['b', 'c','a','d'])

   ohio  teax  cali
b   3.0   4.0   5.0
c   6.0   7.0   8.0
a   0.0   1.0   2.0
d   NaN   NaN   NaN